## Plan Result (prod_frontdoor - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 12 to change, 1 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
* Update
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;court-tribunal-hearings&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;jd-bureau&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-bureau&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-video-web&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Replace
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be updated in-place
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
      ~ body                    = jsonencode(
          ~ {
              ~ identity = {
                  ~ type = "None" -> "SystemAssigned"
                }
            }
        )
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
        name                    = "sdshmcts-prod"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["court-tribunal-hearings"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/court-tribunal-hearings.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_ukzfcfrz4mgmtk2lkl6wggokshyb4wd" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["darts-portal"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.darts"
        name                = "_dnsauth.darts"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_a8r8jgymj86sp2l06z0f4kshhyo9f87" -> null
        }
      + record {
          + value = "_zlx4bifnd7xod9m46igstsvj07d2pll"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["jd-bureau"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/juror-bureau.justice.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "b0ldj8cnldw9t9wny7jdlky92pm5k33l" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-bureau"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apps.hmcts.net/TXT/_dnsauth.juror"
        name                = "_dnsauth.juror"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_ajc1iwoy2mramiwxhrkiuoo1hqdd1sz" -> null
        }
      + record {
          + value = "l5rlhsc06snj2bz0wt94txdk1r4n0390"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-public"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/reply-jury-summons.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_2t3i1s7zj4nj2lz7kh27rxfrg1on5tl" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["portal"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/pre-recorded-evidence.justice.gov.uk/TXT/_dnsauth.portal"
        name                = "_dnsauth.portal"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_zsxh0l8xlbb4kikhtuxpuojao5t81x6" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pre-portal"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.pre-portal"
        name                = "_dnsauth.pre-portal"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_obqduemvr10xaem45zdfod7y0dr5zt6" -> null
        }
      + record {
          + value = "_8vajv8wzyqnbjubygfu9tymxpfa9pdg"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["toffee"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/platform.hmcts.net/TXT/_dnsauth.toffee"
        name                = "_dnsauth.toffee"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_drjigdtfln7vwabs7waor3krrdad56s" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hearings.reform.hmcts.net/TXT/_dnsauth.admin"
        name                = "_dnsauth.admin"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_z23byubtiymrs35qgqhntbv2sdbkyoi" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-video-web"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hearings.reform.hmcts.net/TXT/_dnsauth.video"
        name                = "_dnsauth.video"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "_d5br2vgi9x6phpkbw5a591kagvgl1fd" -> null
        }
      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = (known after apply)
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      ~ id                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod/providers/Microsoft.Authorization/roleAssignments/8446676b-67d6-9e04-ced4-d7d2f9970bd5" -> (known after apply)
      ~ name                                   = "8446676b-67d6-9e04-ced4-d7d2f9970bd5" -> (known after apply)
      ~ principal_id                           = "f1cf7c90-215a-41bd-b42c-e39fd800305b" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 12 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":905,"Program":"tfcmt","SHA1":"","Target":"prod_frontdoor - TerraformPlanApply","Vars":{}} -->